
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL
module.master_nodes[0].proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/200]
module.worker_nodes[1].proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/202]
module.worker_nodes[0].proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/201]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251229084615" -> "packer-debian-13.2.0-20251229131928" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.50" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/200" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
      + machine                   = "q35"
        name                      = "kube-master-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.50" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;master" -> "k3s,master"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (38 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:7c:5d:ab" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:07:13:5a" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      + pcis {
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "24b8188b-79f7-4c0e-afea-b8e96bfad8d2" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251229084615" -> "packer-debian-13.2.0-20251229131928" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.51" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/201" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
      + machine                   = "q35"
        name                      = "kube-worker-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.51" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (38 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:12:3c:de" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:5b:bb:40" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      + pcis {
          + pci0 {
              + raw {
                  + pcie        = false
                  + primary_gpu = false
                  + raw_id      = "0000:00:02.1"
                  + rombar      = false
                }
            }
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "93075e9f-b8b9-437f-ae53-cc5ac0974ef2" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251229084615" -> "packer-debian-13.2.0-20251229131928" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.52" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/202" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
      + machine                   = "q35"
        name                      = "kube-worker-02"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.52" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (38 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:a3:fe:86" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:bf:8d:03" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      + pcis {
          + pci0 {
              + raw {
                  + pcie        = false
                  + primary_gpu = false
                  + raw_id      = "0000:00:02.2"
                  + rombar      = false
                }
            }
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "ad74d91d-82e7-4d0e-ab29-2188f1ab2c5e" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*